       IDENTIFICATION DIVISION.
       PROGRAM-ID. CUSTINQ.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY CUSTCPY.
       PROCEDURE DIVISION.
           EXEC CICS RECEIVE MAP('CUSTMAP') END-EXEC.
           EXEC CICS LINK PROGRAM('CUSTSVC') END-EXEC.
           EXEC CICS SEND MAP('CUSTMAP') END-EXEC.
           GOBACK.
